//==============================================================================
//
//  ## @file
//  Syntax Extension Test UNI File for EDK II Multi-String .UNI File Format Specification, Revision 1.40
//
//==============================================================================

// Include Files (#include)
#include "SharedTokens.uni"

// Language Definitions (#langdef)
#langdef en-US "English"
#langdef fr-FR "Français"
#langdef zh-Hant-TW "台灣文字系統繁體中文"

#language en-US "Line 1\r\n"
#language fr-FR "Ligne 1\r\n"

// Font Definitions (#fontdef)
#fontdef CustomFont1 "Arial" 12 "bold|italic"
#fontdef CustomFont2 "Times New Roman" 16 "normal"
#fontdef SystemFont  "Courier New" 19 "underline|shadow|emboss"

// Global Font Command (#font)
#font CustomFont1

#string STR_MODULE_ABSTRACT             #language en-US "This is a basic abstract string."
                                        #language fr-FR "Ceci est un résumé de base."

#string STR_COMPACT_IDENTIFIER          #language en-US "Testing compact format" // Trailing comment
#string STR_URL_TEST                    #language en-US "Visit http://tianocore.org for info"

// String Extensions with Font Attributes (#string, #font, #language)
// Case A: #font attribute BEFORE the first #language identifier (applies to all languages)
#string STR_GLOBAL_FONT_TEST #font CustomFont2 #language en-US "Hello with CustomFont2"
                                               #language fr-FR "Bonjour with CustomFont2"

// Case B: #font attribute AFTER the #language identifier (language-specific priority)
#string STR_LOCAL_FONT_TEST #language en-US #font SystemFont "Hello with SystemFont 32"
                            #language fr-FR "Bonjour with default CustomFont1"

// String Content Escape Characters & Font Control Codes (\f, \n, \r, \t)
#string STR_ESCAPE_AND_FONT_CODE_TEST #language en-US "Text \n New Line \r CR \t Tab \"Quotes\" \\Backslash\\"
                                                      "Font change: \f!CustomFont2!Switched Font\fbBold Toggle\fiItalic\f!CustomFont1!"
                                                      "Size and Style: \fh!24!Big Text\fuUnderline\fdDoubleUnderline\fsShadow\feEmboss"
                                      #language zh-Hant-TW "文字 \n 換行 \r 歸位鍵 \t 縮排 \"雙引號\" \\反斜線\\"
                                                           "字體更改: \f!CustomFont2!切換字體\fb粗體切換\fi斜體\f!CustomFont1!"
                                                           "大小和樣式: \fh!24!大字型\fu底線\fd雙底線\fs陰影\fe浮雕"   // Comment can start here

// Visual Width Modifiers (\narrow, \wide, \br, \nbr)
#string STR_WIDTH_CONTROL_TEST #language en-US "\narrowNarrow Chars\wideWide Chars\brBreak here\nbrNo break"

// Unicode Hex Escape Sequence (\x followed by 4 hex digits)
#string STR_UNICODE_TEST #language en-US "UCS-2 Hex characters: \x0041\x0042\x0043" // Displays: ABC
